package com.evgeniyfedorchenko.simplearraylist.interfaces;

public interface SimpleList<E> extends Iterable<E>{

    /**
     * Добавление элемента.
     * Вернуть добавленный элемент в качестве результата выполнения.
     */
    E add(E item);

    /**
     * Добавление элемента на определенную позицию списка.
     * Если выходит за пределы фактического количества элементов или массива,
     * выбросить исключение. Вернуть добавленный элемент в качестве результата выполнения.
     */
    E add(int index, E item);

    /**
     * Установить элемент на определенную позицию затерев существующий.
     * Выбросить исключение, если индекс больше фактического
     * количества элементов или выходит за пределы массива.
     */
    E set(int index, E item);

    /**
     * Удаление элемента.
     * Вернуть удаленный элемент или исключение, если подобный элемент отсутствует в списке.
     */
    E remove(E item);

    /**
     * Удаление элемента по индексу.
     * Вернуть удаленный элемент или исключение, если подобный элемент отсутствует в списке.
     */
    E remove(int index);

    /**
     * Проверка на существование элемента.
     * Вернуть true/false;
     */
    boolean contains(E item);

    /**
     * Поиск элемента.
     * Вернуть индекс элемента или -1 в случае отсутствия.
     */
    int indexOf(E item);

    /**
     * Поиск элемента с конца.
     * Вернуть индекс элемента или -1 в случае отсутствия.
     */
    int lastIndexOf(E item);

    /**
     * Получить элемент по индексу. Вернуть элемент или исключение,
     * если выходит за рамки фактического количества элементов.
     */
    E get(int index);

    /**
     * Сравнить текущий список с другим.
     * Вернуть true/false или исключение,
     * если передан null.
     */
    boolean equals(Object otherList);

    /**
     * Вернуть фактическое количество элементов.
     */
    int size();

    /**
     * Вернуть true,
     * если элементов в списке нет,
     * иначе false.
     */
    boolean isEmpty();

    /**
     * Удалить все элементы из списка.
     */
    void clear();

    /**
     * Создать новый массив
     * из строк в списке и вернуть его.
     */
    Object[] toArray();

    void sortSelection();
}
